Repository: toyoda-divakk/DesktopAssistant
Catalog: DesktopAssistant/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# AppDisplayName
source: DesktopAssistant
ja_jp: 俺の仕事用のPCにバーチャルアシスタントがやってきた件。～AIが優秀過ぎてアイツ無しでは仕事が進められなくなったがもう遅い～

# AppDescription
source: DesktopAssistant
ja_jp: 仕事

# Shell_Main.Content
source: Main
ja_jp: メイン

# Shell_Welcome.Content
source: Welcome
ja_jp: 未定♪

# Shell_Personal.Content
source: Personal
ja_jp: キャラ選択

# Settings_Personalization.Text
source: Display
ja_jp: 表示設定

# Settings_Theme.Header
source: Theme
ja_jp: テーマ選択

# Settings_Theme_Light.Content
source: Light
ja_jp: ライトテーマ

# Settings_Theme_Dark.Content
source: Dark
ja_jp: ダークテーマ

# Settings_Theme_Default.Content
source: Default
ja_jp: デフォルト

# Settings_About.Text
source: About this application
ja_jp: このソフトウェアについて

# Settings_AboutDescription.Text
source: Display a mascot character on your desktop to support your work.
ja_jp: デスクトップにマスコットキャラクターを表示し、あなたの仕事をサポートします。

# SettingsPage_PrivacyTermsLink.Content
source: Privacy Statement
ja_jp: 作者の巣窟

# Shell_CharacterSettings.Content
source: CharacterSettings
ja_jp: キャラ作成

# Settings_Api.Text
source: Configuration of Generation AI API
ja_jp: 生成AIのAPI設定

# Settings_Api_ApiKey.Text
source: API Key
ja_jp: APIキー

# Settings_Api_AzureOpenAI_Endpoint.Text
source: Endpoint
ja_jp: エンドポイント

# Settings_Api_Model.Text
source: Model Name
ja_jp: モデル名

# Button_Save.Text
source: Save
ja_jp: 保存

# Saved.Message
source: Change completed.
ja_jp: 変更しました。

# Button_ApiTest.Text
source: Test API
ja_jp: APIテスト

source: Hello.
ja_jp: こんにちは。

# Settings_Theme.Description
source: Select a light or dark theme.
ja_jp: ライトテーマかダークテーマを選択します。

# Settings_ApiTest.Description
source: Ensure that AI is available in this setting.
ja_jp: この設定でAIが利用できることを確認します。

# Settings_ApiTest.Header
source: API Execution Testing
ja_jp: APIの実行テスト

# Settings_Api_Service.Description
source: Select the generating AI service.
ja_jp: 生成AIサービスを選択します。

# Settings_Api_Service.Header
source: Selection of Generative AI Services
ja_jp: 生成AIサービスの選択

# Settings_Api_Top.Description
source: Configure settings for using the generated AI. The settings you have entered will not be reflected until you click the Save button.
ja_jp: 生成AIを利用するための設定を行います。入力した設定は保存ボタンをクリックするまで反映されません。

# Settings_Api_Top.Header
source: Configuration of Generation AI API
ja_jp: 生成AIのAPI設定

# Settings_AzureOpenAI.Description
source: For Azure, please obtain the necessary configuration information from Azure OpenAI Studio.
ja_jp: Azureの場合、Azure OpenAI Studioから必要な設定情報を取得してください。

# Settings_OpenAI.Description
source: Create an account at OpenAI and obtain an API key.
ja_jp: OpenAIでアカウントを作成して、APIキーを取得してください。

source: ToDoList
ja_jp: ToDoリスト

# Button_Cancel
source: Cancel
ja_jp: キャンセル

# Button_Delete
source: Delete
ja_jp: 削除

# Button_NoRegrets
source: No regrets
ja_jp: 後悔しない

# Message_ConfirmDelete1
source: Are you sure you want to delete it?
ja_jp: 本当に削除するのですか？

# Message_ConfirmDelete2
source: You won't regret it, will you?
ja_jp: 後悔しませんね？

# Message_DeleteCategory
source: Do you want to delete a category?
ja_jp: カテゴリを削除しますか？

# Button_Edit
source: Edit
ja_jp: 編集
